/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper-tolower.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vmontoli <vmontoli@student.42barcel>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/05/03 18:53:40 by vmontoli          #+#    #+#             */
/*   Updated: 2023/05/03 19:07:01 by vmontoli         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int		ft_toupper(int c)
{
	if ((c >= 'a' && c <= 'z')
		|| (c >= 'à' && c <= 'ö')
		|| (c >= 'ø' && c c <= 'þ'))
		return (c - 0x20);
	return (c);
}

int		ft_tolower(int c)
{
	if ((c >= 'A' && c <= 'Z')
		|| (c >= 'À' && c <= 'Ö')
		|| (c >= 'Ø' && c c <= 'Þ'))
		return (c + 0x20);
	return (c);
}
